//----------------------------------------------------------------------------
var T_HMI_Net;//定时器对象存储变量
var NetPicStatu=0;//网页的网络连接状态图标的显示状态标志
//----------------------------------------------------------------------------
var OutputName=new Array("#Q0_0","#Q0_1","#Q0_2","#Q0_3","#Q0_4","#Q0_5","#Q0_6","#Q0_7","#Q1_0","#Q1_1");//输出口状态LED的ID名存储数组
var InputName=new Array("#I0_0","#I0_1","#I0_2","#I0_3","#I0_4","#I0_5","#I0_6","#I0_7","#I1_0","#I1_1","#I1_2","#I1_3","#I1_4","#I1_5");//输入口状态LED的ID名存储数组
//----------------------------------------------------------------------------
var OutputStatu=new Array(0,0,0,0,0,0,0,0,0,0);//PLC输出口输出状态存储数组
var InputStatu=new Array(0,0,0,0,0,0,0,0,0,0,0,0,0,0);//PLC输入口输入状态存储数组
//----------------------------------------------------------------------------
var Display=new Array("none","block");//display属性的值的存储数组
var BgColor=new Array("#4a5a68","#00ff00");//颜色存储数组
//----------------------------------------------------------------------------
var PLC_Number="0001";//PLC编号存储数组
//获取用户数据
var info = window.localStorage.info;
var data7 = JSON.parse(info);
var nip = window.localStorage.nip;
